<a href="https://colab.research.google.com/github/vincent0965/Colab_note/blob/master/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [24]:
from urllib.request import urlretrieve
url = "https://github.com/Elwing-Chou/ml0930/raw/master/titanic/train.csv"
urlretrieve(url, "train.csv")
url = "https://github.com/Elwing-Chou/ml0930/raw/master/titanic/test.csv"
urlretrieve(url, "test.csv")

('test.csv', <http.client.HTTPMessage at 0x7f6c700f67b8>)

In [25]:
import pandas as pd
train_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")

Combin with two csv (train and test)

In [26]:
datas = pd.concat([train_df, test_df], axis=0, ignore_index=True)
datas

      PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0               1       0.0       3  ...    7.2500   NaN         S
1               2       1.0       1  ...   71.2833   C85         C
2               3       1.0       3  ...    7.9250   NaN         S
3               4       1.0       1  ...   53.1000  C123         S
4               5       0.0       3  ...    8.0500   NaN         S
...           ...       ...     ...  ...       ...   ...       ...
1304         1305       NaN       3  ...    8.0500   NaN         S
1305         1306       NaN       1  ...  108.9000  C105         C
1306         1307       NaN       3  ...    7.2500   NaN         S
1307         1308       NaN       3  ...    8.0500   NaN         S
1308         1309       NaN       3  ...   22.3583   NaN         C

[1309 rows x 12 columns]

In [33]:
# del data(PassengerId, Survived)
# data type: number:age、SibSp、Parch、Ticket(count)、Fare；type:P-Class、Name(mid)、Sex、Cabin(First)、Embarked
datas.drop(["PassengerId", "Survived"], axis=1)

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...   NaN         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2          3                             Heikkinen, Miss. Laina  ...   NaN         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4          3                           Allen, Mr. William Henry  ...   NaN         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...   NaN         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...  C105         C
1306       3                       Saether, Mr. Simon Sivertsen  ...   NaN         S
1307       3                                Ware, Mr. Frederick  ...   NaN         S
1308       3                           Peter, Master. Michael J  ...   NaN         C

[1309 rows x 10 columns]

check NaN for every colunm

In [34]:
# make up none data: type=>fill usually value
na = datas.isna().sum()
# chooes data:Series[True/False list/series]
na[na > 0].sort_values(ascending=False)
# ascending(降冪排列)

Cabin       1014
Survived     418
Age          263
Fare           1
dtype: int64

In [35]:
# Caculate munber of ["Embarked"] and fill a value into ["Embarked"]
most = datas["Embarked"].value_counts().idxmax()
datas["Embarked"] = datas["Embarked"].fillna(most)

In [36]:
# 先處理ticket
dic = datas["Ticket"].value_counts()
def count(n):
  return dic[n]
datas["Ticket"] = datas["Ticket"].apply(count)

In [37]:
# make up none data: number=>fill median
datas.median()
# Pclass is not a number, drop Pclass and don`t fill in value

PassengerId    655.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Ticket         713.0000
Fare            14.4542
dtype: float64

In [38]:
med = datas.median().drop(["Pclass"])
datas = datas.fillna(med)

In [39]:
# check what value was make up
na = datas.isna().sum()
# chooes Series[True/False list/series]
na[na > 0].sort_values(ascending=False)

Cabin    1014
dtype: int64

In [40]:
def cabin(c):
  if pd.isna(c):
    return None
  else:
    return c[0]
datas["Cabin"] = datas["Cabin"].apply(cabin)

Enbarked:type => One-Hot Encoding, the data lost over 50%

S、C、Q => binary tree (0 or 1), separate all value and check.

If the value is unknow how, it`s become (0,0,0)

In [41]:
datas["Name"]

0                                 Braund, Mr. Owen Harris
1       Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                  Heikkinen, Miss. Laina
3            Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                Allen, Mr. William Henry
                              ...
1304                                   Spector, Mr. Woolf
1305                         Oliva y Ocana, Dona. Fermina
1306                         Saether, Mr. Simon Sivertsen
1307                                  Ware, Mr. Frederick
1308                             Peter, Master. Michael J
Name: Name, Length: 1309, dtype: object

In [42]:
# Name:type=>keep height frequance name

def name(n):
    mid = n.split(",")[-1].split(".")[0]
    mid = mid.strip()
    return mid
# check Name and find top 4 name (Mr、Mrs、Miss、Master) 
middle = datas["Name"].apply(name)
counts = middle.value_counts()
reserved = counts[:4].index
# Replace all Name for top 4 (Mr、Mrs、Miss、Master) 
def name2(mid):
    if mid in reserved:
        return mid
    else:
        return None
datas["Name"] = middle.apply(name2)

In [43]:
datas.drop(["PassengerId", "Survived"], axis=1)

      Pclass    Name     Sex   Age  ...  Ticket      Fare  Cabin  Embarked
0          3      Mr    male  22.0  ...     713    7.2500   None         S
1          1     Mrs  female  38.0  ...     264   71.2833      C         C
2          3    Miss  female  26.0  ...     713    7.9250   None         S
3          1     Mrs  female  35.0  ...     264   53.1000      C         S
4          3      Mr    male  35.0  ...     713    8.0500   None         S
...      ...     ...     ...   ...  ...     ...       ...    ...       ...
1304       3      Mr    male  28.0  ...     713    8.0500   None         S
1305       1    None  female  39.0  ...     147  108.9000      C         C
1306       3      Mr    male  38.5  ...     713    7.2500   None         S
1307       3      Mr    male  28.0  ...     713    8.0500   None         S
1308       3  Master    male  28.0  ...     147   22.3583   None         C

[1309 rows x 10 columns]